In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('ds_salaries.csv')
df

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L
...,...,...,...,...,...,...,...,...,...,...,...,...
602,602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

In [4]:
df.describe()

       Unnamed: 0    work_year        salary  salary_in_usd  remote_ratio
count  607.000000   607.000000  6.070000e+02     607.000000     607.00000
mean   303.000000  2021.405272  3.240001e+05  112297.869852      70.92257
std    175.370085     0.692133  1.544357e+06   70957.259411      40.70913
min      0.000000  2020.000000  4.000000e+03    2859.000000       0.00000
25%    151.500000  2021.000000  7.000000e+04   62726.000000      50.00000
50%    303.000000  2022.000000  1.150000e+05  101570.000000     100.00000
75%    454.500000  2022.000000  1.650000e+05  150000.000000     100.00000
max    606.000000  2022.000000  3.040000e+07  600000.000000     100.00000

In [5]:
df.sort_values('salary')

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
238,238,2021,EN,FT,Data Scientist,4000,USD,4000,VN,0,VN,M
185,185,2021,MI,FT,Data Engineer,4000,USD,4000,IR,100,IR,M
15,15,2020,MI,FT,Data Analyst,8000,USD,8000,PK,50,PK,L
124,124,2021,EN,PT,Data Analyst,8760,EUR,10354,ES,50,ES,M
196,196,2021,EN,FT,BI Data Analyst,9272,USD,9272,KE,100,KE,S
...,...,...,...,...,...,...,...,...,...,...,...,...
285,285,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L
137,137,2021,MI,FT,ML Engineer,8500000,JPY,77364,JP,50,JP,S
7,7,2020,MI,FT,Data Scientist,11000000,HUF,35735,HU,50,HU,L
102,102,2021,MI,FT,BI Data Analyst,11000000,HUF,36259,HU,50,US,L
177,177,2021,MI,FT,Data Scientist,30400000,CLP,40038,CL,100,CL,L

In [6]:
df.sort_values(['salary','salary_currency'])

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
185,185,2021,MI,FT,Data Engineer,4000,USD,4000,IR,100,IR,M
238,238,2021,EN,FT,Data Scientist,4000,USD,4000,VN,0,VN,M
15,15,2020,MI,FT,Data Analyst,8000,USD,8000,PK,50,PK,L
124,124,2021,EN,PT,Data Analyst,8760,EUR,10354,ES,50,ES,M
196,196,2021,EN,FT,BI Data Analyst,9272,USD,9272,KE,100,KE,S
...,...,...,...,...,...,...,...,...,...,...,...,...
136,136,2021,MI,FT,ML Engineer,7000000,JPY,63711,JP,50,JP,S
137,137,2021,MI,FT,ML Engineer,8500000,JPY,77364,JP,50,JP,S
7,7,2020,MI,FT,Data Scientist,11000000,HUF,35735,HU,50,HU,L
102,102,2021,MI,FT,BI Data Analyst,11000000,HUF,36259,HU,50,US,L
177,177,2021,MI,FT,Data Scientist,30400000,CLP,40038,CL,100,CL,L

In [7]:
df[(df['experience_level'] == 'SE')&(df[salary_currency] == 'USD' )]

NameError: name 'salary_currency' is not defined

In [ ]:
df.groupby(['experience_level', 'salary']).mean()

                          Unnamed: 0  work_year  salary_in_usd  remote_ratio
experience_level salary
EN               4000          238.0     2021.0         4000.0           0.0
                 8760          124.0     2021.0        10354.0          50.0
                 9272          196.0     2021.0         9272.0         100.0
                 10000         279.5     2021.0        10000.0         100.0
                 12000         104.5     2021.0        12000.0         100.0
...                              ...        ...            ...           ...
SE               1799997       197.0     2021.0        24342.0         100.0
                 3000000       129.0     2021.0        40570.0          50.0
                 4000000       198.0     2021.0        54094.0          50.0
                 4900000       263.0     2021.0        66265.0           0.0
                 7000000       285.0     2021.0        94665.0          50.0

[357 rows x 4 columns]

In [ ]:
df.groupby(['experience_level', 'salary']).max()

                          Unnamed: 0  work_year employment_type  \
experience_level salary
EN               4000            238       2021              FT
                 8760            124       2021              PT
                 9272            196       2021              FT
                 10000           521       2022              FT
                 12000           113       2021              PT
...                              ...        ...             ...
SE               1799997         197       2021              FT
                 3000000         129       2021              FT
                 4000000         198       2021              FT
                 4900000         263       2021              FT
                 7000000         285       2021              FT

                                          job_title salary_currency  \
experience_level salary
EN               4000                Data Scientist             USD
                 8760                  Data Analyst             EUR
                 9272               BI Data Analyst             USD
                 10000                 Data Analyst             USD
                 12000                 AI Scientist             USD
...                                             ...             ...
SE               1799997  Machine Learning Engineer             INR
                 3000000        Lead Data Scientist             INR
                 4000000       Data Science Manager             INR
                 4900000  Machine Learning Engineer             INR
                 7000000       Data Science Manager             INR

                          salary_in_usd employee_residence  remote_ratio  \
experience_level salary
EN               4000              4000                 VN             0
                 8760             10354                 ES            50
                 9272              9272                 KE           100
                 10000            10000                 PT           100
                 12000            12000                 PK           100
...                                 ...                ...           ...
SE               1799997          24342                 IN           100
                 3000000          40570                 IN            50
                 4000000          54094                 IN            50
                 4900000          66265                 IN             0
                 7000000          94665                 IN            50

                         company_location company_size
experience_level salary
EN               4000                  VN            M
                 8760                  ES            M
                 9272                  KE            S
                 10000                 NG            S
                 12000                 US            S
...                                   ...          ...
SE               1799997               IN            L
                 3000000               IN            L
                 4000000               US            L
                 4900000               IN            L
                 7000000               IN            L

[357 rows x 10 columns]

In [ ]:
df.groupby('experience_level').max()

,Unnamed: 0,work_year,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
experience_level,,,,,,,,,,,
EN,601,2022,PT,Research Scientist,4450000,USD,250000,VN,100,VN,S
EX,483,2022,FT,Principal Data Scientist,6000000,USD,600000,US,100,US,S
MI,606,2022,PT,Research Scientist,30400000,USD,450000,VN,100,US,S
SE,605,2022,FT,Staff Data Scientist,7000000,USD,412000,VN,100,US,S